---
title: "Cutadapt"
author: "Stanislav Romanov"
date: '2023-04-04'
tags: ["Cutadapt", "Обрезка прочтений","Баркоды","Фильтрация прочтений"]
editor_options: 
  markdown: 
    wrap: 400
    toc: true
---

# Назначение Cutadapt

Для амплификации молекул ДНК перед секвенированием к молекулам с обоих сторон прикрепляются адаптеры - универсальные последовательности, предназначенные для отжига праймеров и затравок для секвенирования. Если длина фрагмента ДНК, встроенного между адаптерами, меньше длины прочтения, то последовательность адаптера неизбежно войдет в состав осеквенированного рида. Cutadapt изначально создавался как инструмент, предназначенный для удаления адаптеров из прочтений. Со временем спектр возможностей Cutadapt многократно расширился, сделав эту программу одним из самых популярных приложений в биоинформатике. Сейчас Cutadapt позволяет проводить практически любые манипуляции с прочтениями, включая обрезку *(trimming)*, фильтрацию по качеству *(quality filtering)*, переименование. Сюда добавлены возможности по обработке баркодов, включая демультиплексирование, что делает этот инструмент крайне полезным для массового параллельного репортерного анализа.

# Установка

Советую использовать только Anaconda. В [мануале](https://cutadapt.readthedocs.io/en/stable/guide.html) приведено гораздо больше вариантов.

```
conda install cutadapt
```

#
