---
title: "Экстракция c PEG"
author: "Romanov Stanislav"
date: "19 09 2021"
output: html_document
lang: russian
---

Экстракция c полиэтиленгликолем (ПЭГ, PEG) является быстрым и сравнительно простым методом очистки дцДНК из реакционных смесей, таких как ПЦР и реакции рестрикции. Преимуществом метода является возможность удалять фрагменты ДНК малого размера в процессе очистки. Изменяя концентрацию ПЭГ, можно регулировать диапазон осажденных фрагментов ДНК.

{{% notice "info" %}}
Полимерный полиэтиленгликоль способен вытеснять молекулы ДНК из водных растворов в присутствии катионов Na, K или Mg. Опуская физическую природу явления, кратко этот эффект можно объяснить следующим образом: полимер PEG заполняет объем реакционной смеси, выталкивая ДНК в оставшееся пространство (больше PEG - меньше свободного пространства). В то же время положительно заряженные катионы притягиваются к отрицательно заряженным фосфатным группам нуклеиновой кислоты и экранируют заряд ДНК. В отсутсвие достаточного пространства длинные молекулы ДНК конденсируются и выпадают в осадок, тогда как короткие молекулы ДНК, праймеры, белки и dNTP остаются растворены в свободном пространстве водной фазы. Таким образом, чем выше концентрация PEG и катионов, тем короче молекулы ДНК, выпавшие в осадок.
{{% /notice %}}
{{% notice "warning" %}}
Эффективность осаждения с PEG в присутствии MgCl2 сильно падает, когда концентрация ДНК в растворе меньше 10 нг/мкл. Для количественного осаждения или очистки убедитесь, что в растворе достаточно ДНК. Это можно сделать с помощью электрофореза.
{{% /notice %}}

#### Протокол очистки ДНК с PEG

**1.** Довести объем реакции до 100 мкл с помощью mQ.

{{% notice "tip" %}}
Доводить до 100 мкл не обязательно. Это делается для удобства. Убедитесь, что при разбавлении концентрация ДНК не падает ниже 10 нг/мкл
{{% /notice %}}

**2.** Добавить 50 мкл (половину объема) стокового раствора 45%PEG-8000+30мМ MgCl<sub>2</sub>. Итоговая концентрация MgCl<sub>2</sub> должна быть 10 мМ.

{{% notice "note" %}}
Трехкратный стоковый раствор 45%PEG-8000+30mM MgCl2 используется для очистки ПЦР-продуктов от праймеровых димеров. С использованием такого стока концентрация PEG в растворе с ДНК будет 15%, что позволяет избавиться от ДНК<100-150bp. При необходимости можно довести сток до желаемой концентарции PEG добавлением нужного объема 30 мМ MgCl2.
{{% /notice %}}
{{% notice "note" %}}
PEG-8000 — это полимерный этиленгликоль с молекулярной массой 8000 Да. Для переосаждения ДНК подходят и другие марки полимера, например, PEG-6000. Правда это может повлиять на общий выход и селективные особенности очистки
{{% /notice %}}

**3.** Центрифугировать 15 минут на 10000g при комнатной температуре.

{{% notice "tip" %}}
Здесь и дальше осадок не будет заметен, так что нужно пометить часть пробирки, в которой должен выпасть осадок, с помощью маркера. В дальнейшем нужно ориентировать пробирку относительно одинаковым способом.
{{% /notice %}}

**4.** Удалить супернатант, не задевая осадок.

**5.** Чтобы избавиться от остаточных солей и PEG, промыть осадок с 1 мл 70% этанола. Центрифугировать &gt;5 мин при &gt;10000g на комнатной температуре.

**6.** Удалить супернатант, не задевая осадок. Можно повторить отмывку этанолом для более качественной очистки, затем снова центрифугировать.

**7.** Сбросить остатки этанола центрифугированием и отобрать супернатант по-максимому с помощью микропипетки на 20 мкл.

**8.** Осушить осадок в течение 3-5 минут до исчезновения следов этанола.

{{% notice "warning" %}}
Сушить осадок нужно не больше 5 минут. Пересушенная ДНК плохо растворяется в воде.
{{% /notice %}}

**9.** Растворить осадок в нужном объеме mQ или TE.

#### Селекция размеров ДНК с PEG+10Mm MgCl<sub>2</sub>

При уменьшении концентрации PEG селективные свойства полимера изменяются, позволяя удалять из препарата более длинные молекулы ДНК.

| Концентрация PEG в растворе с ДНК + 10мМ MgCl<sub>2</sub> | Минимальная длина осажденной ДНК |
|-----------------------------------------------------------|----------------------------------|
| 10%                                                       | \~300bp                          |
| 6%                                                        | \~500bp                          |
| 5%                                                        | \~700bp                          |
| 4%                                                        | \~1000bp                         |

{{% notice "warning" %}}
Эффективность осаждения ДНК сильно падает при концентрациях PEG меньше 10%
{{% /notice %}}

#### Дополнительные источники

{{% attachments style="orange" pattern=".*(pdf)" title="Очистка и переосаждение ДНК с PEG" %}}
